frontend/controllers/DeviceController.php

    public function actionCreate()
    {
        $model = new Device();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `device` (`serial_number_device`, `id_store`, `create_date`, `update_date`) VALUES ('kjlh;jkl;jk;kjl;jk', 2, NOW(), NOW())

    protected function findModel($id)
    {
        if (($model = Device::findOne($id)) !== null) {
---
SELECT * FROM `device` WHERE `id`='3'