frontend/controllers/StoreController.php

INSERT INTO `store` (`store_name`, `create_date`, `update_date`) VALUES ('г. Мухосранск', NOW(), NOW())
---
    public function actionCreate()
    {
        $model = new Store();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `store` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Store::findOne($id)) !== null) {