frontend/models/DeviceSearch.php

SELECT `device`.* FROM `device` WHERE `id_store`='2'
---
    public function searchDeviceInStore($post) {
        $id_store = (!empty($post['id_store'])) ? $post['id_store'] : 0;
        $query = Device::find()->select('device.*')->where(['id_store' => $id_store])->asArray()->all();