frontend/views/device/_form.php


    <?= $form->field($model, 'serial_number_device')->textInput(['maxlength' => true])->label('Серийный номер устройства') ?>

    <?= $form->field($model, 'id_store')->widget(Select2::classname(), [
        'data' => array_merge(['0' => ' '], ArrayHelper::map(Store::find()->all(), 'id', 'store_name')),
        'language' => 'ru',
        'options' => [
            'placeholder' => 'Выберите...',
            'options' => [
                '0' => ['disabled' => true],
            ],
        ],
        'pluginOptions' => [
        'allowClear' => true
        ],
    ])->label('Склад'); ?>
---
SELECT * FROM `store`