frontend/views/device/index.php

                'filter' => Select2::widget([
                    'model' => $searchModel,
                    'attribute' => 'id_store',
                    'data' => ArrayHelper::map(Store::find()->all(), 'id', 'store_name'),
---
SELECT * FROM `store`