frontend/views/device/view.php

    </p>

    <?php
        $store_name_record = Store::findOne($model->id_store);
---
SELECT * FROM `store` WHERE `id`=3